<template>
  <div>
    <div class="auth-page" v-if="er">
      <div
        class="auth-header d-flex justify-content-between align-items-center"
      >
        <img src="@/assets/logo-new.svg" />
        <div class="auth-header-actions">
          <a href="tel:+7888">+7 (800) 333-98-87</a>
          <a href="mailto:sale@oxrapro.ru">sale@oxrapro.ru</a>
        </div>
      </div>
      <b-container>
        <div class="auth-form">
          <form>
            <div class="auth-form-inner">
              <div class="form-group auth-title">Регистрация</div>
              <div class="form-group auth-subtitle text-center">
                Завершите регистрацию на потрале для <br />
                клиентов Bro Oxrapro
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Email</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="12"
                        height="12"
                        viewBox="0 0 12 12"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M12 5.35338C12 5.81454 11.9448 6.27068 11.8344 6.7218C11.724 7.17293 11.5533 7.58396 11.3225 7.95489C11.1016 8.32581 10.8206 8.62155 10.4793 8.84211C10.138 9.05263 9.73651 9.15789 9.27478 9.15789C8.90339 9.15789 8.57716 9.07268 8.29611 8.90226C8.01506 8.7218 7.81932 8.49123 7.70891 8.21053H7.58846C7.3877 8.46115 7.11669 8.6817 6.77541 8.87218C6.44416 9.06266 6.04266 9.15789 5.57089 9.15789C4.67754 9.15789 3.98494 8.89223 3.4931 8.3609C3.01129 7.81955 2.77039 7.11278 2.77039 6.2406C2.77039 5.56892 2.91593 4.97744 3.20703 4.46617C3.49812 3.94486 3.90966 3.53885 4.44166 3.24812C4.97365 2.94737 5.601 2.79699 6.32371 2.79699C6.79548 2.79699 7.28231 2.84211 7.78419 2.93233C8.29611 3.01253 8.6926 3.10276 8.97365 3.20301L8.82309 6.28571C8.81305 6.38596 8.80803 6.49123 8.80803 6.6015C8.80803 6.70175 8.80803 6.76692 8.80803 6.79699C8.80803 7.20802 8.86324 7.48371 8.97365 7.62406C9.0941 7.75439 9.22459 7.81955 9.36512 7.81955C9.59598 7.81955 9.7867 7.70927 9.93726 7.48872C10.0878 7.25815 10.1982 6.95739 10.2685 6.58647C10.3488 6.20551 10.389 5.78947 10.389 5.33835C10.389 4.49624 10.2183 3.78446 9.87704 3.20301C9.53576 2.61153 9.06901 2.1604 8.47679 1.84962C7.8946 1.53885 7.2271 1.38346 6.47428 1.38346C5.42033 1.38346 4.532 1.60401 3.80928 2.04511C3.09661 2.47619 2.55458 3.06767 2.18319 3.81955C1.81179 4.57143 1.6261 5.43358 1.6261 6.40601C1.6261 7.7594 1.98745 8.79699 2.71016 9.5188C3.44291 10.2406 4.49184 10.6015 5.85696 10.6015C6.43915 10.6015 7.04642 10.5363 7.67879 10.406C8.31117 10.2757 8.88833 10.1153 9.41029 9.92481V11.3383C8.92848 11.5388 8.39147 11.6992 7.79925 11.8195C7.20703 11.9398 6.57967 12 5.91719 12C4.67252 12 3.60853 11.7794 2.72522 11.3383C1.84191 10.8972 1.16437 10.2657 0.692597 9.44361C0.230866 8.61153 0 7.61404 0 6.45113C0 5.53885 0.150565 4.69173 0.451694 3.90977C0.752823 3.12782 1.18444 2.44612 1.74655 1.86466C2.3187 1.27318 3.00125 0.817042 3.79423 0.49624C4.5872 0.165413 5.47553 0 6.45922 0C7.53325 0 8.48682 0.215539 9.31995 0.646617C10.1531 1.07769 10.8055 1.69424 11.2773 2.49624C11.7591 3.29825 12 4.25063 12 5.35338ZM4.47177 6.27068C4.47177 6.82206 4.5872 7.21805 4.81807 7.45865C5.04893 7.69925 5.35508 7.81955 5.73651 7.81955C6.23839 7.81955 6.58971 7.6391 6.79046 7.2782C7.00125 6.90727 7.12672 6.42606 7.16688 5.83459L7.25721 4.21053C7.1468 4.19048 7.02133 4.17544 6.8808 4.16541C6.74028 4.14536 6.58469 4.13534 6.41405 4.13534C5.94228 4.13534 5.56085 4.2406 5.26976 4.45113C4.98871 4.65163 4.78294 4.91729 4.65245 5.24812C4.53199 5.56892 4.47177 5.90977 4.47177 6.27068Z"
                          fill="#575E66"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="text"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="ivanov@mail.ru"
                  />
                </div>
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Пароль</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="10"
                        height="11"
                        viewBox="0 0 10 11"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M4.92779 3.86144e-05C3.56364 -0.00648805 2.36589 0.814827 1.78725 2.09811C1.48963 2.81065 1.50733 3.7865 1.52113 4.63863H0V11H10V4.63863H8.34582V3.43216C8.34582 2.95917 8.24884 2.52259 8.06767 2.09811C7.53801 0.879433 6.29194 0.00656528 4.92779 3.86144e-05ZM4.92779 2.02561C5.72467 2.04684 6.30592 2.64852 6.3406 3.42008V4.63863H3.52635V3.43216C3.60156 2.59227 4.1309 2.00437 4.92779 2.02561Z"
                          fill="#4A5056"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="password"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="Пароль"
                  />
                </div>
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Повторите пароль</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="10"
                        height="11"
                        viewBox="0 0 10 11"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M4.92779 3.86144e-05C3.56364 -0.00648805 2.36589 0.814827 1.78725 2.09811C1.48963 2.81065 1.50733 3.7865 1.52113 4.63863H0V11H10V4.63863H8.34582V3.43216C8.34582 2.95917 8.24884 2.52259 8.06767 2.09811C7.53801 0.879433 6.29194 0.00656528 4.92779 3.86144e-05ZM4.92779 2.02561C5.72467 2.04684 6.30592 2.64852 6.3406 3.42008V4.63863H3.52635V3.43216C3.60156 2.59227 4.1309 2.00437 4.92779 2.02561Z"
                          fill="#4A5056"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="password"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="Повторите пароль"
                  />
                </div>
              </div>
              <div class="form-group">
                <div class="form-check">
                  <input
                    class="form-check-input"
                    type="checkbox"
                    id="autoSizingCheck"
                  />
                  <label class="form-check-label" for="autoSizingCheck">
                    Даю согласие на обработку персональных данных.
                  </label>
                </div>
              </div>
              <div class="form-group text-center auth-submit">
                <button
                  type="submit"
                  class="btn btn-primary mb-2"
                  @click="error"
                >
                  Зарегистрироваться
                </button>
              </div>
            </div>
          </form>
        </div>
      </b-container>
    </div>
    <div class="auth-page" v-else>
      <div
        class="auth-header d-flex justify-content-between align-items-center"
      >
        <img src="@/assets/logo-new.svg" />
        <div class="auth-header-actions">
          <a href="tel:+7888">+7 (800) 333-98-87</a>
          <a href="mailto:sale@oxrapro.ru">sale@oxrapro.ru</a>
        </div>
      </div>
      <b-container>
        <div class="auth-form auth-form--error">
          <form>
            <div class="auth-form-inner">
              <div class="form-group auth-title">Регистрация</div>
              <div class="alert alert-error">
                <a class="close" data-dismiss="alert" href="#"
                  ><svg
                    width="8"
                    height="8"
                    viewBox="0 0 8 8"
                    fill="none"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      d="M4.93909 3.99943L7.80299 1.14179C7.92841 1.01635 7.99886 0.846231 7.99886 0.668843C7.99886 0.491455 7.92841 0.321332 7.80299 0.1959C7.67758 0.0704672 7.50748 0 7.33011 0C7.15275 0 6.98265 0.0704672 6.85724 0.1959L4 3.06021L1.14276 0.1959C1.01735 0.0704672 0.847248 -1.32164e-09 0.669885 0C0.492522 1.32165e-09 0.322423 0.0704672 0.197008 0.1959C0.0715939 0.321332 0.00113664 0.491455 0.00113663 0.668843C0.00113663 0.846231 0.0715939 1.01635 0.197008 1.14179L3.06091 3.99943L0.197008 6.85708C0.134583 6.919 0.085035 6.99267 0.0512219 7.07385C0.0174088 7.15502 0 7.24208 0 7.33002C0 7.41795 0.0174088 7.50502 0.0512219 7.58619C0.085035 7.66737 0.134583 7.74104 0.197008 7.80296C0.258924 7.8654 0.332587 7.91495 0.413748 7.94877C0.494909 7.98259 0.581962 8 0.669885 8C0.757808 8 0.844861 7.98259 0.926022 7.94877C1.00718 7.91495 1.08085 7.8654 1.14276 7.80296L4 4.93866L6.85724 7.80296C6.91915 7.8654 6.99282 7.91495 7.07398 7.94877C7.15514 7.98259 7.24219 8 7.33011 8C7.41804 8 7.50509 7.98259 7.58625 7.94877C7.66741 7.91495 7.74108 7.8654 7.80299 7.80296C7.86542 7.74104 7.91497 7.66737 7.94878 7.58619C7.98259 7.50502 8 7.41795 8 7.33002C8 7.24208 7.98259 7.15502 7.94878 7.07385C7.91497 6.99267 7.86542 6.919 7.80299 6.85708L4.93909 3.99943Z"
                      fill="white"
                    />
                  </svg> </a
                ><span>Внимание!</span> Логин и пароль не совпадают
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Email</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="12"
                        height="12"
                        viewBox="0 0 12 12"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M12 5.35338C12 5.81454 11.9448 6.27068 11.8344 6.7218C11.724 7.17293 11.5533 7.58396 11.3225 7.95489C11.1016 8.32581 10.8206 8.62155 10.4793 8.84211C10.138 9.05263 9.73651 9.15789 9.27478 9.15789C8.90339 9.15789 8.57716 9.07268 8.29611 8.90226C8.01506 8.7218 7.81932 8.49123 7.70891 8.21053H7.58846C7.3877 8.46115 7.11669 8.6817 6.77541 8.87218C6.44416 9.06266 6.04266 9.15789 5.57089 9.15789C4.67754 9.15789 3.98494 8.89223 3.4931 8.3609C3.01129 7.81955 2.77039 7.11278 2.77039 6.2406C2.77039 5.56892 2.91593 4.97744 3.20703 4.46617C3.49812 3.94486 3.90966 3.53885 4.44166 3.24812C4.97365 2.94737 5.601 2.79699 6.32371 2.79699C6.79548 2.79699 7.28231 2.84211 7.78419 2.93233C8.29611 3.01253 8.6926 3.10276 8.97365 3.20301L8.82309 6.28571C8.81305 6.38596 8.80803 6.49123 8.80803 6.6015C8.80803 6.70175 8.80803 6.76692 8.80803 6.79699C8.80803 7.20802 8.86324 7.48371 8.97365 7.62406C9.0941 7.75439 9.22459 7.81955 9.36512 7.81955C9.59598 7.81955 9.7867 7.70927 9.93726 7.48872C10.0878 7.25815 10.1982 6.95739 10.2685 6.58647C10.3488 6.20551 10.389 5.78947 10.389 5.33835C10.389 4.49624 10.2183 3.78446 9.87704 3.20301C9.53576 2.61153 9.06901 2.1604 8.47679 1.84962C7.8946 1.53885 7.2271 1.38346 6.47428 1.38346C5.42033 1.38346 4.532 1.60401 3.80928 2.04511C3.09661 2.47619 2.55458 3.06767 2.18319 3.81955C1.81179 4.57143 1.6261 5.43358 1.6261 6.40601C1.6261 7.7594 1.98745 8.79699 2.71016 9.5188C3.44291 10.2406 4.49184 10.6015 5.85696 10.6015C6.43915 10.6015 7.04642 10.5363 7.67879 10.406C8.31117 10.2757 8.88833 10.1153 9.41029 9.92481V11.3383C8.92848 11.5388 8.39147 11.6992 7.79925 11.8195C7.20703 11.9398 6.57967 12 5.91719 12C4.67252 12 3.60853 11.7794 2.72522 11.3383C1.84191 10.8972 1.16437 10.2657 0.692597 9.44361C0.230866 8.61153 0 7.61404 0 6.45113C0 5.53885 0.150565 4.69173 0.451694 3.90977C0.752823 3.12782 1.18444 2.44612 1.74655 1.86466C2.3187 1.27318 3.00125 0.817042 3.79423 0.49624C4.5872 0.165413 5.47553 0 6.45922 0C7.53325 0 8.48682 0.215539 9.31995 0.646617C10.1531 1.07769 10.8055 1.69424 11.2773 2.49624C11.7591 3.29825 12 4.25063 12 5.35338ZM4.47177 6.27068C4.47177 6.82206 4.5872 7.21805 4.81807 7.45865C5.04893 7.69925 5.35508 7.81955 5.73651 7.81955C6.23839 7.81955 6.58971 7.6391 6.79046 7.2782C7.00125 6.90727 7.12672 6.42606 7.16688 5.83459L7.25721 4.21053C7.1468 4.19048 7.02133 4.17544 6.8808 4.16541C6.74028 4.14536 6.58469 4.13534 6.41405 4.13534C5.94228 4.13534 5.56085 4.2406 5.26976 4.45113C4.98871 4.65163 4.78294 4.91729 4.65245 5.24812C4.53199 5.56892 4.47177 5.90977 4.47177 6.27068Z"
                          fill="#575E66"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="text"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="ivanov@mail.ru"
                  />
                </div>
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Пароль</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="10"
                        height="11"
                        viewBox="0 0 10 11"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M4.92779 3.86144e-05C3.56364 -0.00648805 2.36589 0.814827 1.78725 2.09811C1.48963 2.81065 1.50733 3.7865 1.52113 4.63863H0V11H10V4.63863H8.34582V3.43216C8.34582 2.95917 8.24884 2.52259 8.06767 2.09811C7.53801 0.879433 6.29194 0.00656528 4.92779 3.86144e-05ZM4.92779 2.02561C5.72467 2.04684 6.30592 2.64852 6.3406 3.42008V4.63863H3.52635V3.43216C3.60156 2.59227 4.1309 2.00437 4.92779 2.02561Z"
                          fill="#4A5056"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="password"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="Пароль"
                  />
                </div>
              </div>
              <div class="form-group">
                <label for="inlineFormInputGroup">Повторите пароль</label>
                <div class="input-group mb-2">
                  <div class="input-group-prepend">
                    <div class="input-group-text">
                      <svg
                        width="10"
                        height="11"
                        viewBox="0 0 10 11"
                        fill="none"
                        xmlns="http://www.w3.org/2000/svg"
                      >
                        <path
                          d="M4.92779 3.86144e-05C3.56364 -0.00648805 2.36589 0.814827 1.78725 2.09811C1.48963 2.81065 1.50733 3.7865 1.52113 4.63863H0V11H10V4.63863H8.34582V3.43216C8.34582 2.95917 8.24884 2.52259 8.06767 2.09811C7.53801 0.879433 6.29194 0.00656528 4.92779 3.86144e-05ZM4.92779 2.02561C5.72467 2.04684 6.30592 2.64852 6.3406 3.42008V4.63863H3.52635V3.43216C3.60156 2.59227 4.1309 2.00437 4.92779 2.02561Z"
                          fill="#4A5056"
                        />
                      </svg>
                    </div>
                  </div>
                  <input
                    type="password"
                    class="form-control"
                    id="inlineFormInputGroup"
                    placeholder="Повторите пароль"
                  />
                </div>
              </div>
              <div class="form-group">
                <div class="form-check">
                  <input
                    class="form-check-input"
                    type="checkbox"
                    id="autoSizingCheck"
                  />
                  <label class="form-check-label" for="autoSizingCheck">
                    Даю согласие на обработку персональных данных.
                  </label>
                </div>
              </div>
              <div class="form-group text-center auth-submit">
                <button type="submit" class="btn btn-primary mb-2" @click="error">
                  Зарегистрироваться
                </button>
              </div>
            </div>
          </form>
        </div>
      </b-container>
    </div>
  </div>
</template>

<script>
import Widget from "../../components/Widget/Widget";
import { mapActions, mapState } from "vuex";

export default {
  name: "RegisterPage",
  components: { Widget },
  data() {
    return {
      er: true,
    };
  },
  computed: {
    ...mapState("register", {
      isFetching: (state) => state.isFetching,
      errorMessage: (state) => state.errorMessage,
    }),
  },
  methods: {
    error(e) {
      e.preventDefault();
      this.er = !this.er ;
    },
    ...mapActions("register", ["registerUser", "registerError"]),
    ...mapActions("auth", ["loginUser"]),
    register() {
      const email = this.$refs.email.value;
      const password = this.$refs.password.value;

      if (!this.isPasswordValid()) {
        this.checkPassword();
      } else {
        this.registerUser({
          creds: { email, password },
          $toasted: this.$toasted,
        });
      }
    },
    googleLogin() {
      this.loginUser({ social: "google" });
    },
    microsoftLogin() {
      this.loginUser({ social: "microsoft" });
    },
    checkPassword() {
      if (!this.isPasswordValid()) {
        if (!this.$refs.password.value) {
          this.registerError("Password field is empty");
        } else {
          this.registerError("Passwords are not equal");
        }
        setTimeout(() => {
          this.registerError();
        }, 3 * 1000);
      }
    },
    isPasswordValid() {
      return (
        this.$refs.password.value &&
        this.$refs.password.value === this.$refs.confirmPassword.value
      );
    },
  },
};
</script>

<style lang="scss">
.alert-error {
  background-color: #fadac8;
  font-size: 12px;
  span {
    font-weight: 700;
  }
  color: #ec692c;
  .close {
    opacity: 1 !important;
  }
}
.auth-form--error {
  .input-group-text {
    background-color: #fadac8;
    border-color: #ec692c;
    svg {
      fill: #ec692c;
      path {
        fill: #ec692c;
      }
    }
  }
  .form-control {
    border-color: #ec692c;
    background-image: url("data:image/svg+xml,%3Csvg width='12' height='13' viewBox='0 0 12 13' fill='none' xmlns='http://www.w3.org/2000/svg'%3E%3Cpath d='M6 5.42383C6.13261 5.42383 6.25979 5.47651 6.35355 5.57027C6.44732 5.66404 6.5 5.79122 6.5 5.92383V8.92383C6.5 9.05644 6.44732 9.18361 6.35355 9.27738C6.25979 9.37115 6.13261 9.42383 6 9.42383C5.86739 9.42383 5.74021 9.37115 5.64645 9.27738C5.55268 9.18361 5.5 9.05644 5.5 8.92383V5.92383C5.5 5.79122 5.55268 5.66404 5.64645 5.57027C5.74021 5.47651 5.86739 5.42383 6 5.42383Z' fill='%23EC692C'/%3E%3Cpath d='M5.99998 4.67383C6.09847 4.67383 6.196 4.65443 6.28699 4.61674C6.37798 4.57905 6.46066 4.5238 6.53031 4.45416C6.59995 4.38451 6.65519 4.30183 6.69289 4.21084C6.73058 4.11985 6.74998 4.02232 6.74998 3.92383C6.74998 3.82534 6.73058 3.72781 6.69289 3.63682C6.65519 3.54582 6.59995 3.46314 6.53031 3.3935C6.46066 3.32385 6.37798 3.26861 6.28699 3.23092C6.196 3.19323 6.09847 3.17383 5.99998 3.17383C5.80133 3.17383 5.61082 3.25274 5.47035 3.39321C5.32989 3.53367 5.25098 3.72418 5.25098 3.92283C5.25098 4.12148 5.32989 4.31199 5.47035 4.45245C5.61082 4.59292 5.80133 4.67183 5.99998 4.67183V4.67383Z' fill='%23EC692C'/%3E%3Cpath d='M0 6.42383C-1.17411e-08 5.6359 0.155195 4.85568 0.456723 4.12773C0.758251 3.39977 1.20021 2.73834 1.75736 2.18119C2.31451 1.62404 2.97595 1.18208 3.7039 0.880551C4.43185 0.579023 5.21207 0.423828 6 0.423828C6.78793 0.423828 7.56815 0.579023 8.2961 0.880551C9.02405 1.18208 9.68549 1.62404 10.2426 2.18119C10.7998 2.73834 11.2417 3.39977 11.5433 4.12773C11.8448 4.85568 12 5.6359 12 6.42383C12 8.01513 11.3679 9.54125 10.2426 10.6665C9.11742 11.7917 7.5913 12.4238 6 12.4238C4.4087 12.4238 2.88258 11.7917 1.75736 10.6665C0.632141 9.54125 2.37122e-08 8.01513 0 6.42383ZM6 1.42383C4.67392 1.42383 3.40215 1.95061 2.46447 2.88829C1.52678 3.82598 1 5.09775 1 6.42383C1 7.74991 1.52678 9.02168 2.46447 9.95936C3.40215 10.897 4.67392 11.4238 6 11.4238C7.32608 11.4238 8.59785 10.897 9.53553 9.95936C10.4732 9.02168 11 7.74991 11 6.42383C11 5.09775 10.4732 3.82598 9.53553 2.88829C8.59785 1.95061 7.32608 1.42383 6 1.42383Z' fill='%23EC692C'/%3E%3C/svg%3E%0A");
    background-repeat: no-repeat;
    background-position: calc(100% - 10px) center;
    padding-right: 26px !important;
  }
}
input::-ms-reveal,
input::-ms-clear {
  display: none;
}
</style>